{"podcast_details": {"podcast_title": "Money Talks from The Economist", "episode_title": "Money Talks: Click and collect a grocery victory", "episode_image": "https://assets.pippa.io/shows/62e286a934d4d92155874248/1689776291892-06b6034fb17af0c22f73597b6b54d15c.jpeg", "episode_transcript": " In 1916 in Memphis, Tennessee, a grocery store named Piggly Wiggly opened its doors with a big new idea. For the first time, shoppers would walk around and pick their groceries themselves rather than handing a list to a store clerk. And so the supermarket was born. One once compared the self-service store with a lending library and accept that you have to buy the goods. That's the principle it works on. Choose for yourself. Although the coming decades saw plenty of innovation, from shopping trolleys to bar codes, from the perspective of customers, grocery shopping remained largely the same. More recently, however, a new generation of digital native businesses have been looking to upend the grocery industry. Most notable is the e-commerce titan Amazon, which launched its online grocery delivery service Amazon Fresh back in 2007. You can now get groceries from amazon.com if you live in San Francisco. But it hasn't been smooth sailing for Amazon. With its online grocery business struggling to gain traction, the company began experimenting with physical stores. And in 2017, made a huge bet. Since then, Amazon has been trying to reinvent the in-store experience of grocery shopping. So let's go check it out. I'm here outside an Amazon Fresh store in central London. At first glance, it looks like a regular supermarket. The one big difference is that here there are no checkouts. So I'm going to go pop in and grab myself a bite to eat. The first thing I do is open my app and scan myself in. Now my snack of choice today is a banana, so let me just go find one that looks appropriately ripe. It looks like they only have packs of five. Okay, well I've secured the bananas. Now all I need to do is walk out of the store feeling a bit like a bandit, but with my bank balance one pound lighter. Amazon's just walkout technology is a nice touch, but it hardly feels like a revolution in grocery shopping. Meanwhile, as Amazon has been tinkering with checkouts, traditional brick and mortar retailers have been busily building rival online offerings. Grocery shopping is a giant prize, accounting for around $800 billion of spending a year in America. But it is also a notoriously tough business, with price-sensitive customers keeping a tight lid on margins. Add in online delivery and it often becomes unprofitable. So what is the future of grocery shopping in the digital era? And who will come out on top? You're listening to Money Talks from The Economist, our weekly podcast on the markets, the economy and the world of business. In London, I'm Tom Lee Devlin. In Singapore, I'm Mike Bird. In Washington DC, I'm Alice Fullwood. And in today's show, why is it so hard to convince people to do their grocery shopping online? First, we discuss the enduring appeal of shopping in-store. Then, we hear what's putting people off buying more of their groceries online. The price pressure is a real one. It will reduce the amount of folks that are actually interested in the service. Finally, we explore why Amazon has failed to have the impact that many expected. Amazon frankly came to grocery with a little bit of that arrogance. Hey Mike, hey Alice. Hey Tom. Hey Tom. It's great to see that the usual order of things has been restored. You're both back in your rightful places. So Mike, I can see that you're in Singapore and you are alone in the studio, Tom, as it should be. Thanks for that. I'm certainly feeling very alone now. But I'm glad Mike's back in Asia and that you're in the US because we'll be leaning heavily on your knowledge of local markets for this episode, particularly supermarkets. So how do you guys do your grocery shopping? It has actually been so long since we were all in the right place that I thought Alice was based in Lexington, Kentucky. My shopping habits, there's a few local places. Fair Price, which I guess is the sort of Singaporean, Tesco or Walmart equivalent. I do order quite a few things from Grab, which I suppose is the Southeast Asian Uber slash Instacart slash Seamless. If I want something from sort of a variety of places, that's a good option for me. Yeah, I tend to do my grocery shopping in store, whether I am in Washington or Lexington or anywhere else that I might need to acquire groceries, which I think is mostly because of the way that I like to shop, which is I like to sort of go most days and pick up whatever it is that I need for dinner like that evening. And doing that online would be pretty ruinously expensive, given all the additional fees and delivery costs, which is an even bigger problem because American grocery stores are already ruinously expensive. There's a huge difference between the price that you pay for groceries in somewhere like Washington or New York and what you would pay in a sort of more Central America suburban town like Lexington. Going to the massive Kroger there, you can fill up your cart and just walk out for free. Try that in Washington and that's your paycheck gone. It's quite different to the UK, which I think, number one, has fantastic grocery stores and number two, much more even pricing between the city centers and rural areas. I used to be an in-store shopping loyalist, but I made the switch to online ordering during the pandemic. I think a lot of other people did the same thing. I use this service called Ocado, which is very popular here in Britain. I like it mostly because I'm very much a creature of habit. So I basically eat more or less exactly the same food every week, which means shopping for groceries takes about two minutes as I can just kind of select the exact same basket that I had the week before. Having said that, it is certainly more expensive and sometimes you end up with odd substitutions and kind of underripe blueberries or overripe avocados, which is not ideal. An absolutely terrifying look inside the mind of a consumer consultant there on Tom's shopping habits. What could he possibly do when that avocado is underripe? His whole meal, his whole week meal plan will be thrown off. Everything goes in the bin. Spiraling into crisis. Paroxysms of fear. Well yes, I suppose it turns out I am actually in the minority here and not just on our show. So the pandemic did push a lot of grocery shoppers online, perhaps not quite as obsessively regimented ones as myself, but still less than a tenth of grocery sales in America at least are done online these days. That is considerably less than I would have expected. Less than 10% really doesn't seem like very much. Yeah, I agree. And especially because online grocery shopping here covers quite a few different things. It covers everything from home delivery through to curbside pickup, which is where staff in the stores do the shopping for you, picking out the goods and then putting it in bags and you just pull up outside the shop in your car and they deliver it to you. And I imagine that for retailers, the economics of those two options are quite different. Exactly. So if you take curbside pickup, you really only have to add the cost of having staff wander around the store and pick up items. And in some cases, you can just use the stuff that are already there anyway, depending on how busy the store is. But things are a bit trickier when it comes to home delivery because of what logistics types call the last mile or if you're Walmart in America, the last 10 miles, given 90% of Americans live within 10 miles of one of their stores. And getting products those last few miles is where a lot of the cost actually ends up being. So companies have different models for dealing with those last few miles. One is to have vans ferry between stores and customers, sometimes using third parties like Instacart in America or Grab where you are, Mike. And the other is to have big fulfillment centers like the ones Amazon is famous for and the ones Ocado uses here in Britain, which tend to be a little bit further away from customers. And the benefit of those is that they can be heavily automated. But the downside is that you end up having to travel longer distances to your customers. And the important thing about the grocery business is that compared to say electronics, the margins are really incredibly thin as consumers tend to be very price sensitive. Typically you're looking at operating margins between 2% and 4%, which doesn't leave you a lot of wiggle room to add in extra costs. Companies like Walmart are experimenting with it anyway though to avoid falling prey to disruptors like Amazon that they fear will seize this category from them. So do you think they can make it work? Well that's the big question. And to find out more, I spoke to Bill Orr. He works for the consulting firm McKinsey where he runs their North American retail practice. Bill, thank you so much for joining us on Money Talks. Great to be here. Thanks for having me. To kick us off, could you tell us a bit about how the pandemic changed the grocery business? During the period of time before COVID, e-commerce was a little less than 4% of sales for grocery in the US. That doubled relatively overnight to kind of 9% to 10%. Doubling econ penetration in a month or two period, obviously there was a lot of shock into a system that has grown slowly over the years. And through that, I think what we saw was in the early days of the pandemic, really larger grocers taking share, being more reliable in sources of supply and providing more flexibility to consumers in how they wanted to shop. So the penetration of online grocery shopping jumped pretty sharply during that period, but it's been fairly stagnant since then. And in absolute terms, it's much, much lower than in other categories like say books or consumer electronics. So why is online delivery so difficult in the grocery space? Yeah, it's a question that also is I think conflated with the current economic conditions in the US as well. E-commerce and grocery is seen as a convenience play. People understand there's a premium involved with that. But you've got headwinds from economic conditions. And we run a survey of about 3,000 consumers every six months to understand what are their behaviors, why are they doing what they're doing. The number one reason that people say they don't use more online grocery is because of the expense. 36% of people say, I would use it more, but it's too expensive. And so that I think is a primary reason. Secondly, people still prefer an in-store experience for fresh items. There's still some reluctance around, am I going to get the avocado or the bananas that I want at the right ripeness? And that touch and feel has not been one that grocers have been able to overcome. To some extent, there's also been some concern around product availability and what substitutions would they get from online orders. And so if you feel a lack of control and you're paying a premium, the experience isn't terrific. And so really what we've seen is a leveling out on e-commerce penetration really around the shoppers that are just looking for convenience. And that is what has driven what we're seeing broadly in the sector around 8% to 9% penetration is where it holds. And obviously that evolves depending on the population density. We're seeing urban centers as high as 20%, 25% and certainly more rural and suburban areas actually back down to pre-COVID levels of 3% and 4%. You mentioned the cost of grocery delivery being high, which is interesting because in other areas of e-commerce, that's not really the case. Can you just talk us through why so many grocers add those extra fees for online delivery? As many retailers do look at the profit and loss of the individual businesses, be it the in-store brick and mortar business or the e-commerce business, when they look at a standalone e-commerce business, it looks like it's generating a loss. And that's largely driven by the extra labor that's involved in picking and fulfilling online orders. And so it does generate a question around how do you mitigate that? And there have been two or three paths that we've seen grocers take. One is they actually step back and say, I'm not going to look at that P&L as an independent business. I'm going to look at holistically how valuable is that customer and how important is my offering online services to them shopping with me and creating profit for my business? But others have said, I really want to drive profitability within e-commerce alone. And to do that, they have really focused on either managing the commercial aspects, meaning there might be slightly higher pricing online. There might be promotions that aren't offered online to offset some of that cost. Or they've added fees to offset the challenges of the model. I know a number of grocers have also been exploring advertising as part of their online offerings to try and improve the margins. Do you see much potential for them in that? Yeah, the growth of retail media networks has been substantial in the US. Obviously Amazon is a clear leader there and it built the market. Walmart has a multi-billion dollar retail media business target as well. Kroger also has a very established and high earning retail media business. And other grocers are looking at building that as well. I think they are thinking of the media and advertising business as another value stream the way they've looked at trade funding over the years. And when we talk about online grocery shopping, we're talking both about home delivery, but also curbside pickup. Which of those do you expect is likely to emerge as the dominant form of online grocery shopping? Our research would suggest that there has been more growth in click and collect, that curbside pickup that you're describing, given that it is a lower cost option than delivery. And delivery continues to be the predominant growth vector, if you will, in these higher urban density areas, that people have less flexibility from a transportation standpoint. But the US in total, I think is biasing a bit more towards click and collect. And so staring into your crystal ball, casting your eyes forward to the years ahead, what do you think the grocery business is going to look like in, say, 2030? Do you think supermarkets are going to go the way of bookstores? Are they going to change? What's this business going to look like in the future? That's the million dollar question. I would love to have a simple answer. I think the vision that we've been seeing, if you fast forward seven to even 10 years, is we could imagine that online e-commerce is likely going to continue to grow. However, most of our estimates would suggest probably more in the mid-teens range in that time frame. So continued growth, but not to the point that you've described, if gone to digital of books or technology or others, where 40% to 60% of sales would be online. And largely, I think that will happen as cost of delivery can come down. The value of automation actually makes it more accessible. And really, the question is the pace at which that occurs. Because I do believe the pricing premium, the price pressure is a real one. It will reduce the amount of folks that are actually interested in the service. And so until that starts to decline, you're not going to see the significant growth in the space. Bill, thank you so much for joining us on the show today. Thanks for having me. So, Alice, Mike, a thing that I find really interesting is this kind of catch-22 on the economics of online groceries. So to make it profitable, given the low margins in groceries, you need to add on a fee and also usually a minimum basket size. But that's actually one of the biggest things stopping the channel from growing. And if the channel doesn't grow, you don't get the necessary utilization of your delivery network, which makes the economics worse. And then I was also really struck by the differences in online uptake between urban and rural areas. I suspect that's partly because you have a lot more busy and well-paid professionals living in urban areas who are willing to pay that premium for convenience. And also, I suppose, you have that greater population density, which makes the whole thing much more efficient. And it probably helps to explain why the penetration of online grocery shopping is actually much higher in countries with high population density like Korea, where it accounts for actually about 20% of the category. Yeah, I was really struck by the fact that it was only 4% of grocery shopping before COVID. And even a pandemic was only enough to get it to 9%. I was also thinking a bit about the point you raised about the difference between cities and rural or suburban areas. And I wonder whether the reason that online grocery shopping isn't more popular in America is just because everyone has a car. When I've used online grocery services in the past, it's always been because I had a sort of unusually high number of very heavy things that I wanted to buy. I wanted to buy some sort of like LaCroix or other drinks like laundry detergent, giant bags of frozen fruit or flour, you know, stuff you're really buying by the kilo. And that was the big pain point for me in New York was lugging all of this stuff back to my fifth floor walk up or whatever. But I do still like doing sort of fresh daily stuff for dinner myself, partly because the way I eat is obviously in complete opposition to Tom, which is that I like to see what's in the shops looking good and use that for my dinner inspiration. So right now there's a lot of good corn and aubergine, etc. Once I have a car, and I can purchase unlimited liquids, I really don't necessarily see the utility of online ordering. So on what sort of groceries we order, I actually feel sort of the opposite. I feel guilty about asking people to bring me heavy things. I don't know why I sort of really worry about the delivery driver. And that's probably fine, because I could have carried the heavy items myself, obviously, and it would be fine for the delivery driver as well. Thinking about the industry a little bit more, it's really interesting how thinking back to the origination of groceries and the way that we buy them, it's the fact that these very, very low margin, very, very efficient businesses only really work because we do the last element of the sort of logistics, because that's part of our everyday lives. And people think of their trip to the shop not as them being the last mile delivery driver, but that is what they're doing. So I'm not totally surprised in some ways that it doesn't do as well or doesn't have as much penetration as other forms of e-commerce. Labor costs obviously matter too, this is going to work in some places. It works in Singapore, for example, because you do have relatively low labor costs in large parts of the population, but it's not going to work quite as well in the US at all. It sounds sort of silly, but I wonder whether there's a blockage here because there's something sort of tangible about a lot of groceries, except for the products that you know really, really well. If I'm buying fruit and vegetables, I really want to see what they look like, and I want to feel them, and I want to sort of make sure that they're not bruised or damaged, and that it's exactly what I was looking for. It's slightly harder to tell from a picture. It's often no quicker to order. If I'm coming home from work or something and the shop is on the way anyway, it's not a massive efficiency saving for me. So yeah, it does feel like there's a lot of reasons for the sort of slower, lower penetration of e-commerce and grocery shopping. You know, I don't think I expected this episode to give me quite as much insight into the sort of deep inner workings of the minds of both of my colleagues, but it turns out that Tom's Patrick Bateman over here and Mike is this sort of kind-hearted soul who feels deep shame about asking a delivery person to bring laundry detergent to his house. He's lugging it back himself. Who guessed? Speaking of the inner workings of enigmatic people and countries, I'm very much looking forward to reading my colleague Miranda's piece on the influence of the Saudis on sports and how the kingdom is using its investment in sports in an attempt to sort of gussy up its reputation a bit. We actually did our own sports episode a few weeks back, and I do think it's just one of these fascinating industries in which economics is really only one of the forces at play. So I can't wait to hear what she thinks about it as well. You can read that piece and more for absolutely nothing by going to economist.com forward slash podcast offer for a free 30 day digital subscription. That is if you're not a subscriber already. After the break, we delve into the intensifying rivalry between Walmart and Amazon and ask who will come out on top. Before the break, we heard about some of the challenges for retailers looking to build out their online grocery offerings. And the two firms really battling it out for this market in America are Amazon and Walmart. Walmart obviously has the upper hand in the sector, but Amazon has the expertise in e-commerce, though it's struggled in grocery so far. To understand why, I spoke to Jason Del Rey, who's the author of a new book called Winner Sells All, which looks at the contest between these two giants. Thank you so much for joining us on Money Talks. Thanks so much for having me. So your book really brings to life this classic case of the innovator's dilemma at Walmart, where the reigning champion fails to embrace a disruptive technology, in this case e-commerce, out of fear of what it would do to their existing business. But in the past few years, Walmart seems to have somewhat regained its mojo after having invested pretty heavily in building out its e-commerce capabilities, just as things have started to seemingly slow down for Amazon. So could you start by just describing for us what the current state of play in e-commerce is in America? Absolutely. So you're right. For several decades, Walmart sort of treated e-commerce as a side project or a hobby, and Amazon they were really kind of fearful of in terms of what it would do to the margins and the sales of their core business in store. More recently, they have gotten more aggressive. The current state of play is that in traditional e-commerce, non-grocery e-commerce, Amazon is still many multiples larger than Walmart when it comes to sales, maybe six or seven times the market share of Walmart in the US. That said, in the grocery space, Amazon has really struggled. And Walmart really was aggressive in what would be called the click and collect model in the UK, but the curbside pickup model in the US. And that has become a real stronghold for them today in the US. And a few years ago, after Amazon purchased Whole Foods, there was this kind of sense that they would soon really dominate the grocery category. But as you alluded to there, things haven't really turned out that way. In fact, this is one area where Walmart has really clearly retained its lead actually, not just in physical stores, but also in online grocery sales as well. So what do you think is behind Amazon's failure to really gain traction in this category? I think there's a couple of things. One is, I think Amazon frankly came to grocery with a little bit of arrogance that they are often or think of themselves as the smartest guys and gals in the room and they've entered new industries and done well. And so they would figure it out. And the other piece is they really look at new markets in terms of differentiation, what they can bring. And I think they believe that technology and maybe technology alone could be a huge differentiator for them that would steal customers from competitors in the grocery space. So we see this just walkout technology where you could just pluck items off of a shelf and walk out of a store. They had it mainly in these convenience stores called Amazon Go, but also in some Amazon Fresh stores. And I think what they found was that stuff might be nice for a certain segment of customers, but many grocery store customers still want in-stock inventory, fresh produce, great merchandising, the brands they love. And I think Amazon over the last few years as they've gone into grocery have failed in that space largely. Going forward, where do you think the balance of focus is likely to be for them between physical grocery sales and online grocery sales? I think they recognize the real challenges of online grocery when it comes to delivery, that model they've struggled with for years. That's why I believe they'll continue to try to figure out physical grocery retail, along with a pickup model associated with it. We've just seen in Chicago and the US that Amazon's introduced a couple of renovated, refreshed Amazon Fresh grocery stores. And the funny thing about that reinvention or refreshing that model is that a lot of it has to do with not technology, but sort of what you'd think of as old school retail behavior or innovation. You know, merchandising, better lighting, better signage, more welcoming font in that signage and just a store that really looks a lot like a grocery store. There's a lot of sort of new twist on old school retail we're now seeing in these refresh models. You know, I think part of Amazon's issue with thinking technology would just be a differentiation in store is that I'm not sure it started really from a customer need. Like how many customers think the worst part of shopping is the checkout. So Jason, what do you think the future of the grocery businesses is going to look like? How are people going to shop and which firms do you think are likely to come out on top? Listen, I think there are going to be customers that want to only shop online, even for groceries, and they'll be okay trading off convenience for maybe missing a product or two or that avocado not being as ripe as they want or overripe. That said, I think there still is a room in this world and we see it every day for great physical retail experiences. And Doug McMillan, Walmart CEO, he stressed this to me, customers want the option to pick up or deliver or shop in store or shop online. And so for the biggest players, they're going to try their best to meet customers where they want, how they want, when they want, and at least have the options available to the customers depending on what their preference is that day. I think Walmart will continue to be a massive player here, at least in the US. I think they've made a lot of great progress. Their biggest challenge is often just their size and bureaucracy. I think under Doug McMillan over the last decade, they've made a lot of ground up in that way. And so they are fierce. I never want to count Amazon out just because they've proven me wrong time and again, but they have a lot to figure out in the space. Jason, thank you so much for joining us on Money Talks. Thanks so much for having me. So Alice, Mike, what do you make of what you've heard today? Yeah, it's really interesting to think about, you know, what are the pain points that Amazon is trying to solve with tech for grocery shopping? I guess checkout can be annoying, but it's never struck me as being sort of one of the worst or most difficult parts of grocery shopping. And it also can be annoying to go and get your own groceries if you're obviously hugely busy. But don't know that it is a huge efficiency saving for me either, given that I sort of like to go and pick whatever it is out depending on sort of the time of the year or what I fancy. So actually, I quite like the grocery store. And I don't think I am entirely alone in that. The pain point I talked about earlier was sort of carrying, you know, heavy stuff back to my apartment. And yeah, for a relatively high fee, you can solve that with delivery. But you know, that becomes less of a problem in a very high car penetration place like America. And I guess if I think about sort of grocery shopping compared with other industries that have really been radically transformed by online shopping or digital ordering, you know, things like clothing or books, the problems that online shopping seemed to solve were ones of sort of selection or choice or price. Choice at grocery stores is sort of rarely the problem that people have. You know, most people do want bananas. It's pretty clear what bananas are. And in fact, you know, online shopping can reduce one element of choice because you can't pick, you know, the ripest tomatoes or whatever. And as we've discussed, it's very difficult for them to compete on price because there is this additional cost of doing this and the margins are so thin anyway. So I guess I feel like I'm in the Walmart corner here. I think they probably don't need to push really aggressively into this because I don't think it is how most people will end up doing things. You know, I think they're right to offer the choice. But most Americans have massive goals and seem happy enough with the status quo. Yeah, like Alice, I was thinking about sort of e-commerce generally in the areas that were really massively disrupted by e-commerce. If you're buying a book, for example, I can buy one of the last paperback copies of a book in a warehouse in Ohio very cheaply. And it might be that there aren't any in the bookshops here. It might be that there aren't any in print anymore. And that's a great solution to what was a real problem. And I think when we discuss these sort of grocery companies, a lot of what you're talking about is incredibly local supply chains, right, especially for fresh food. And getting into those and disrupting them is going to be very, very different. I also think there's an element here, which is how people value their own time and how people think about it when they're spending their time doing something that someone would otherwise do for them. I think with something like grocery shopping, that's so ingrained in people as something they do week in, week out, and it's an ordinary part of their schedule, that they don't really think of their time as mattering that. They don't think of it as a cost. You look at the price of the groceries you purchase, you don't add another 10 or 20 or 30 or whatever number of dollars you think your half an hour of shopping was worth to you, that you could have been doing something else with. But if somebody brings you your groceries, you're definitely going to count the cost to make them do it in the overall cost to yourself. So I do think there's an element of sort of psychology to this. This whole thing also makes me really interested in all of the potential other areas where tech companies are going into industries where they maybe do have this sense of sort of slight arrogance about their capabilities. And they're going into, again, incredibly efficient, low margin industries. They might not be the most sophisticated industries in the world, thinking that they can sort of revolutionize them. On that point around disruption, I do just love Walmart's comeback story. So if you wind back the clock a decade ago, it really seemed like this kind of one time giant of retail had screwed up pretty badly, dawdling with its investments in e-commerce and letting Amazon get a toehold. And after the Whole Foods acquisition, there really was this sense that Amazon had become unstoppable and would become the everything store that it set out to be in its own words, including winning the giant grocery category. And now things look very different. And part of that's because of the slow shift towards online grocery shopping that we've been talking about. But part of it is because Walmart has really invested heavily to catch up with Amazon. And its massive footprint of stores and its big market share in groceries bought it time to do that. So I'm still very bullish on Walmart. I mean, the Walton family is still the world's richest with a cool $225 billion between them. There is something pretty magical about going into a Walmart store. As someone who comes from a quaint, small island, they are just absolutely fast. I understand why people like going. You know, there's just this seems like there's infinite possibility in a Walmart. I enjoyed your description there of Britain as a small, quaint island. Does that seem incorrect to you? Yes, it is certainly very impressive. With that, I think it's probably time for us to pivot to our stats of the week. Someone like to kick us off? Yes, of course. My stat of the week this week is 21 of 33, which is the number of countries in Latin America that get more than half their export revenue from commodities. And I pulled this from a story in our South American section about Latin America's push into mining the metals needed for electric vehicles. So it turns out that 60% of the world's lithium, which is needed in EV batteries, as we've discussed on many episodes of Money Talks before, is actually in Latin America. So you have all these hugely commodity dependent countries, and they are now all going after mining the EV metals that we will need over the next few decades if we're going to convert to a more electric vehicle dominated car industry. But I was really struck by how many of them really are still sort of just dependent on commodities. Two thirds of the countries in Latin America still get more than half their export revenues from them. Sticking with the Americas in general, my stat of the week is 4.1%, which is the Atlanta Fed's estimate for the next quarter of US GDP growth. The Atlanta Fed puts out a forecast that's regularly updated. And I just find this statistic amazing because it makes the American recession that we were talking quite a lot about at the beginning of the year feel very remote indeed. 4.1% is a pretty punchy number. Yeah, yeah, it does really remind me how rapidly things have changed on that front. Well, speaking of being super pumped, my stat of the week is $326 million, which is Uber's operating profit for the second quarter of the year. And that's significant because it's the first time the company has ever turned a profit from its operations. And there's been lots of fanfare and excitement about this. But personally, I have to say that for a company that has generated more than $32 billion of losses, breaking even feels like a pretty low bar. So I mean, just to do a bit of back of the envelope math on this, the company has $21 billion of invested capital on its balance sheet. So annualizing its quarterly profit gets you to around about a 5% return on capital after tax, which is less than half its cost of capital. So Uber's loss making days might be behind it, but it really does have a long way to go before it becomes this kind of giant cash machine that its early investors hoped it was going to become. Well, I would like to thank for one, the Assemble Ranks of the World's Venture Capitalists for funding my heavily subsidized Uber rides over the last decade or so. That dream may now be over. But it was great while it lasted. Thank you. Yeah, when I lived in Singapore, I was trying to think what I did for grocery shopping. And I think I never went because Uber Eats was so cheap that I just got delivery food every night. So I also would like to take a moment to thank the Venture Capitalists of the World. And with that, I'd also like to thank Bill All and Jason Del Rey. And thank you for listening to Money Talks. Don't forget to rate and review us wherever you get your podcasts. And you can always write to us at podcasts at economists.com. Today's show was produced by Dan Asher and Marie Keyworth. Our sound engineer is Jonny Allen. And the executive producer is Marguerite Howell. I'm Tom Lee Devlin. I'm Alice Fullwood. I'm Mike Bird. And this is The Economist. We all need to write for work. Want to improve? Bolster your skills with Economist Education's six-week online course. You'll explore the craft of writing and learn from The Economist's editors how to engage and persuade. Whether it's vibrant memos, pithy social media posts, or storytelling with data. And as a listener, enjoy a 15% discount with the code WRITING. To sign up now at economists.com forward slash business writing."}, "podcast_summary": "In 1916, Piggly Wiggly introduced the concept of self-service in grocery shopping, revolutionizing the industry. More recently, digital native businesses like Amazon have tried to disrupt the grocery industry with online delivery services. However, online grocery shopping has faced challenges such as high costs, limited selection, and customer preferences for in-store fresh produce. Walmart has successfully built out its e-commerce capabilities and remains a dominant player in both physical and online grocery sales. Amazon has struggled to gain traction in the grocery space, but continues to experiment with physical stores and pickup models. The future of grocery shopping is likely to involve a combination of in-store, online, and pickup options, with Walmart and Amazon as key players.", "podcast_guest": "Piggly Wiggly", "podcast_highlights": "Some interesting insights from the transcript include:\n\n- The grocery industry is a challenging business with low margins, making it difficult for online delivery to be profitable.\n- Customers have different preferences when it comes to grocery shopping, with some preferring the convenience of online delivery and others valuing the in-store experience.\n- Amazon has struggled to gain traction in the grocery space, primarily because it underestimated the importance of in-store experience and the preference for fresh produce.\n- Walmart has emerged as a dominant player in the grocery space, leveraging its extensive network of physical stores and investing in e-commerce capabilities.\n- The future of grocery shopping is likely to involve a combination of in-store and online options, with retailers aiming to meet customers' preferences and needs."}