{"podcast_details": {"podcast_title": "This is Product Management", "episode_title": "316 - Experience Design is Product Management", "episode_image": "https://ssl-static.libsyn.com/p/assets/7/e/4/0/7e4053bf4df5fb83/TIPM_logo_-_LibSyn.png", "episode_transcript": " Welcome back to This is Product Management. I'm your host, Rodney Knowles. In this episode, I'll be talking to Tricia Houston, founder and COO of the Experience Build Group. It's her job to help companies improve customer and employee experiences. We'll dive into some of the secrets on how she does it. Let's jump right in. Well, Tricia, I appreciate you joining me today to talk about a whole bunch of things, all related to experience in one way or another. But before we get into that, I'd love for you to tell me a little bit about yourself outside of work. What do you do from front when you're not running a company? Happy to be here, Rodney. So thanks for having me on. Outside of work, you know, a lot of it is my kiddos. I have a 10 year old and a six year old. So we got a lot going on. It's about to be summer break. But when we're not taking them to soccer or doing things like that, there's a lot of video games in our house. And you know, it's some with the kids, you know, a lot of Minecraft and I play Disney Dreamlight Valley with my six year old. She loves it. It's like Stardew Valley and other Disney games like combined into a mashup myself. I'm playing Hogwarts Legacy right now. So loving it. Pretty cool. Good fly around in a broom, make potions. It's really neat. Nice. Well, tell me a little bit about your role at Experience Build Group, Tricia. I lead our practice. So we are the experience design practice sitting within MMR Research Associates based out of the US, which is a custom full service firm. So our experience design group, we're focused exclusively on anything to do with experience. Shocker is why we're talking today. You know, we're method agnostic and industry agnostic. So we're really just a specialty group focused on that topic. But we have designers, we have researchers, we have former marketers, consultants, strategy folks, folks with IT backgrounds. So the diversity within the team is what makes it really kind of cool to be able to think about experiences from a 360 view. That's really interesting. Let me have you unpack that a little bit more. When you're thinking about putting together the company and having all these perspectives, like how does that work when you have people coming from all these different angles and different lenses on what you're doing? Yeah, it's really important kind of to the DNA of what we're trying to do, which is not create more of the same. So it's those different perspectives, partially their career background. But we also try to make sure that on projects, like maybe somebody's really familiar with financial services, for example, we're going to have somebody who knows a lot and also somebody who could bring a beginner's mindset. So it helps us just think of problems differently and think of creative solutions. So I mean, from a business standpoint, which I think you're kind of getting at Roddy, yeah, I mean, we have to have a lot of documented processes and systems. We've got to make those methodologies that are underneath what we do consistent and done the EDG way. And I mean, that's just on us internally. So our team is six now, so it's manageable, but that's going to be very interesting as we grow. I know, Trisha, that you spend a lot of time and as everyone at your company does, thinking a lot about experiences being built into the name and you're constantly working with your customers trying to figure out how do you create better experiences. So that's also a topic that is oftentimes top of mind for people in product and they listen to this podcast and I'd argue if it's not top of mind, it probably should be. We can start in a number of different places, but let's start here. I think how do you personally think about providing a starting place for people to understand their customers? Great question and totally agree with you. I think experience is everyone's job. It's really a mindset. I mean, you can't really think of it as a department. I think companies that do that and you just have your customer success or customer experience department, that's not going to get it done. You have to have everyone in the company kind of rowing in the same direction, which of course is harder. So that's kind of the view we take, especially when we're looking at kind of the end user or the customer experience is all the different ways that it's influenced by the folks internally at the company. So it's not just that very end interaction, but it's what all led up to that interaction. What business systems, what business strategy, what business vision. I mean, it kind of really starts at the beginning from the inside. Yeah, I think that's really interesting and I love what you said about it's not a department, it's more of a mindset. So it means everyone has to be approaching things, thinking about things in a customer centric or a customer first way. If we can sort of agree on that, how do you actually make this work in practice? Start small. I mean, to be real, like, I mean, it's wonderful if we go into a company and like we get C-suite level, you know, buy in, right? And I mean, that's a much longer like transformation project. But even though it's a mindset, you can still build that from the ground up. So honestly, it's funny, like most of our projects, while they have big impact, the scope of them in terms of what they touch is generally pretty limited. Like it might just be a new set of signs or one new feature in an app. And it's looking at the domino effect of how that cascades. An example, like so much of our work is like connecting digital to physical. So connecting like what digital products have you do, like say buy online, pick up in store or order your food and then go pick it up for carry out. How do those two worlds connect? So it's like following those breadcrumbs just off one small change. I know this is a challenge that a lot of companies go through and this is a really just that it's a challenge. So I'd love to unpack this a little bit more with you based on your experience working with a lot of different companies on how to maybe bridge this divide or make sure there's not a divide there. You think first about some examples of when this hasn't gone well, and sort of bridging digital and physical and then maybe some examples of how it has. Yeah, absolutely. Some personal examples of what I've seen of how it hasn't gone great. So I mean, the classic one is you order with your app, you go for a drive through, you get home, you don't have what you need, and you can't tell the store you don't have it through the app. You call the store and they tell you that they're going to put a coupon behind the counter for you the next time you come in on a sticky note. That's a huge disconnect for me, right? I just ordered through your app and that's how you're going to do recovery. That one that was actually like, I didn't think about it was during COVID, like many of us, all the grocery shopping was online, right? And then we found some products at our grocery store that we liked that we weren't buying previously because you just search differently when you shop online. And then I started to go back to the store and I couldn't find them. I didn't know where they were. And so it took me a minute though to realize all I had to do, pick up my phone, look in the app and it told me exactly where it was in the grocery store. And so you talk about how it goes right. It's like, yeah, that's what right, but also I didn't even remember I could do it because it's not habitual yet. So sometimes even when it does go right, it might get missed. So it's about how to communicate that to customers as well. Totally. And it's really, yeah, it's interesting. You mentioned, I'm gonna put it in my terms, you have sort of, you know, what decade are we in? The 2020s way of doing things where, you know, you have like an app and like a 1990s way of doing something where you call someone on the phone and they resolve it in some analog way. So that disconnect in terms of like approach and mentality and everything else is definitely challenging from a customer perspective for sure. Agree. And if I start something digitally, I expect to be able to take it all the way through digitally. Going back to what you said about how to think about things in a customer first way, you said to start small and go from there, but how do you decide where to start? You know, it really depends on the team. So some teams we work with, they're pushing the envelope. So they're pushing new things out into the world. And so they're making sure that those aren't causing ripples. Whereas other teams, it's kind of like a continuum, right? Then you've got folks in the middle who are like, uh, we've got some inkling that something might be wrong in our process, maybe from our VOC surveys or, you know, hearing it from the field or hearing it just for customers directly. Okay, well, let's go look there first. And if we don't have that, we're going to go help them do that. So that's like folks who are just like, we don't know where to start. Okay, well, let's kind of take a full view, look across the landscape. We do a lot of mapping. So activity mapping, journey mapping, I mean, call it what you want, but the end results is a map that shows all the touch points and all the systems. And to be able to use that as a starting point to say, okay, where are we seeing places we need to dig in deeper? That's great. And you hit on something that near and dear to my heart too is like, start where the customers tell you to start too. Like where are you getting that feedback and where is that pointing you? You know, you mentioned VOC programs and other things, just feedback you're getting. So letting that really guide you on where to go oftentimes points you in the right direction. Yeah, that's right. We actually just started working with a client who the first place we told them to look was pull out all the open ends from your VOC survey. So not even the quantitative stuff. It's like, have you all been reading all the responses, not just coding them, which is also important for a different reason, but actually going through and looking for those single responses that might be an indicator of a place to go look. This may serve as a PSA for everyone listening to the podcast. For those of you who are collecting VOC work or you're running an MPS survey with an open end or stuff like that, don't let those go into the graveyard. You're asking people a question, hopefully, because you actually care. So definitely use that data and let that drive where you're going for sure. As you're thinking, Tricia, about how to actually do research, right? We can call it another thing that can make it sound sexier than that, but a lot of times it's just doing research. It's actually going out and understanding your customers in a number of different ways and going through some sort of analytical process to think about that. What does it mean? What guidance would you give someone who is thinking about doing customer research? Don't overcomplicate it, at least to start. I like to talk about it in terms of being like two categories. So when you're doing research, you're either in the mode of understanding, just getting the lay of the land, right? That is less risky. We can all go be detectives in some way. But then when you cross that line into you're trying to predict behavior or you're trying to project opinions at scale, that's when the rigor needs to come in, right? And that's not applicable in all research cases. And especially at the beginning, like when we're talking about starting small to kind of go big, when I'm looking for these hiccups or gaps, I don't need 100 people to tell me that something is broken. One is enough to let me know that I need to dig further. I wonder if this is something that you can dig into a little bit more about the type of gaps that you see. Are these always a bad thing? Well, at first we actually thought they were. So Spirits Built Group is about five years old. So when we started looking at gaps, it was like, got to find them, got to close them all, got to close them all. And what we've learned throughout our work is they're not all necessarily bad or need to be closed in the same way. So what I mean by that is we found they kind of fall into two groups. So experience gaps are either unintentional and those are the ones that do need to be closed. So maybe you have this gap between your app and your physical location and people are lost. Okay, we don't want them to be lost. Let's fix that. But maybe you're making a business choice based on your strategy to have your business run a certain way, but you're not communicating that. So for example, I like to talk about Aldi here. I think they do this well, but I think it's a good example for people to understand is Aldi has a lot of intentional gaps that you would think about in the traditional grocery store experience. You have to put a quarter in the cart. They don't give you bags. They usually only have one checkout person when you go there. And that's all so you can save money. And they're very clear about that. So I'm fine with that. I don't mind having some sacrifice. Experience gaps aren't about eliminating all sacrifice because then everybody would make the same thing, have the same service, do the same. We still need to retain our uniqueness. And that's where those intentional gaps come in. I like that. And I like that framing and I could be wrong, but I think Aldi does that intentionally too, because it's sort of their ethos. They're reminding you at these different points too. It is cheap because of these things and their trade-offs. We're all in this together, right? Yeah. Agree. Totally agree. When you're building new products or developing features for existing ones, one of the most valuable tools you can have at your disposal is feedback. Feedback from the customers you have and the ones you want to have. Using the Disco CX platform, you can have the power of Disco's massive consumer audience at your fingertips, enabling you to gather feedback from millions of people in minutes. To see how this can help you build confidently and more quickly, check out Disco.com. That's D-I-S-Q-O.com. Something else, Tricia, that I know you've talked a lot about, which is really interesting, is being your own customer and thinking about things through that lens. So could you say a little bit more about what that means to you? I think it's a practice that I just started doing, maybe not intentionally. I was a very early adopter of buying online and doing commerce in different ways. At the time, before I was here at MMR, I worked at Home Depot for a few years. I remember going into that job and one of the first studies we did, and this was 12 years ago now, but a big category study for a certain category. I'm looking at this questionnaire and it's written all as if you're going into the store to buy. I'm going to research online and I might even buy online because it was an appropriate category for that. Changing that mentality to actually include that in the survey was natural for me, but a shift for other folks because I am such a student of commerce. It's funny to me sometimes how we don't even realize how much we can absorb on our own just by paying attention to how we buy. If you actually internalize those models, you'll start to see patterns. Some of the best commerce experiences might not be in your own industry. I would encourage you to go out and shop outside your industry and see what you could apply to the products that you're creating in your day to day. I think there's just invaluable things you can learn. I totally agree with you and I've fallen into this trap personally. Sometimes you get so in the weeds on what you're building or what you're selling that the obvious things you're not seeing them, but when you step out a little bit, then you can try to apply things that are maybe not exactly what you're doing that are relevant to what you do. I just gave a personal example. I'm thinking about how do I build a platform or selling a software platform? Well, then I got to think about myself when I'm buying software, what do I think of? What do I think about? What does that process look like? Where do some of the pain points at? What's the buying process? What does that actually look like? How does that impact the product that I build and the marketing campaign and all of that stuff? Looking at analogs, even if they're not perfect, I think is really powerful. I like that a lot. I am fortunate to be able to talk to a good bit of students and whenever we talk about your own experience, they rightfully so ask about bias and bringing up bias in the research you do. They're not wrong to bring that up, but then I remind them, I say, okay, based on what you find out, that doesn't give you permission to then go spend tens of thousands of the company's money. It's just a first initial step. You don't need to worry about the bias just yet. You just got to use that information in the right way. It's all about what you're going to do with what you learn. I want to shift gears a little bit, Trisha, and talk about employee experience because as you said from the onset, you're thinking about experience in a really holistic way. It's not just experience with a product and using a product. It goes really across a number of facets and it's more of a mindset. How do you think about the connection between customer experience and employee experience? You can tell me if those distinctions even make sense, but I'll leave them there for now. How do you think about the connection between the two? I think as terms, they do make sense. We think of them that way too, but we think as everything starting from the inside out. The customer experience is a byproduct of the employee experience. It all starts internally. While I talked earlier about starting small, I can start small and fix those signs that I talked about that I was testing earlier. If there's a part that's team dependent, staff dependent, human dependent, I don't have all those things in place even if it's support, if it's software based, then the whole thing might fall apart despite my best laid plans. Employee experience is really about preparation is how we talk about it because that's where you're thinking about the systems, the details, the what ifs and trying to identify as many gaps as you can and those come in a couple of flavors, the gaps too, but it's not about persuading. It's not about marketing. It's not about getting people to do things they wouldn't do otherwise. It's just about being really well prepared and making sure everybody's rowing in the same direction. How do you go about getting everyone to row in the same direction? While the vision is like everybody in the same direction, again, you might have to start really small and then grow it unless you're doing top down. It's really about a vision that is around what I call the other business you're in. Your business produces something. You produce products. You produce a service, a software, a something, but what other business are you in? For example, Chick-fil-A talks about we don't just sell chicken. We're in the leadership business or Zappos. We don't just sell shoes. We're in the customer service business and they reward on the longest call customer service for anything. What actions are you doing? What actions are you setting up for your employees, training them to do that support your other business? That's really the foundation of getting everybody rowing in the right direction is values and mission and all that stuff is important, but unless they're linked to activities, it's hard for the employees to know what to do. Southwest is a great example. I know things are a little different after COVID, but all their activities are mapped to reinforce their positioning as the love airline. I think that's a really interesting way to think about things. I think oftentimes there's so much focus on the business you're actually in. What other businesses are we in? I honestly never really think about things that way. I think it's an interesting frame to get people to rally behind what you're actually doing and to all be moving in the same direction. Lots of interviews. Most of our employee work revolves around training, a lot of persona development, qualitative, figuring out how to close learning gaps, that sort of thing. Give me a little bit of a peek behind the curtain there in terms of what are your secrets, just a few of them, in terms of training. Maybe how does understanding of the customer and the customer experience feed into that employee training? It's like setting the stage. If you buy into which we do, not the metaphor that work is theater, but that work is theater. It's essentially like creating the script, creating, setting the stage for how you want this interaction to go. If you have a group of employees that's remote or a team that's distributed, it's even more important to have that, especially with frontline folks, customer service or retail. You're essentially writing the script. Some companies actually do that. They do true service standards. That might, to me, is a little bit a step too far. It's more about the general rules and filters because that's what creates the experience. In software, you can program a bunch of it. You can make the systems do a lot of things, but this is about the human touch points, which we know differentiate. Totally. Those human touch points, especially I'm thinking about from a software lens, those human touch points can be, it's not just like, hey, I'm trying to execute the task, but it's like something went wrong. I need help getting over a certain bump or there's an obstacle or a challenge. That requires a different approach for sure. Yes, absolutely. One thing we advise clients to ask if they're doing surveys out to their customer, ask if doing business with us is a chore or if you look forward to it, kind of like on a polar scale with each at the end and see what they say. Did they actually look forward to it or is it just like they have to fall in or what they just avoided if they could? Trisha, there's a question I would ask you. I like sort of ask people on the way out usually has nothing to do with anything we talked about so far. Asking for a recommendation for something for our audience that's been entertaining you lately or something you've been into could be a video game, could be a movie, could be a podcast, a band you're listening to, whatever. What have you been up to lately? Yeah, so reading more here lately, my friend turned me on. I think I was late to the game with Libby, like where you can get the library books on your Kindle. If you don't have Libby, it's amazing. I was today resolved when I heard this word so now I do not know this. Through the app, you can get ebooks from your local library for free and read them on your Kindle. So anyway, so my favorite one lately, which I would recommend highly is 4000 Weeks of Management for Mortals by Oliver Berkman. And it challenges this whole idea of like, we have to be so productive with our time and really starting to think of like our time is finite, which forces you to make choices. So highly recommended. Thanks Trisha. I really, really appreciate you taking the time to chat me today. Yeah, absolutely. Thanks for having me on, Roddy. This was great. Now we know how to mine the gaps between customer and employee as well as between digital and physical experiences to get everyone in a company rowing in the same direction. I especially love Trisha's take on always being mindful of the other business you're in. That's our show for today. You can connect with Trisha on LinkedIn. You can learn more about the Experience Built Group at ebg.live. This is Roddy from Disco. I'll catch you all next time."}, "podcast_summary": "Welcome back to This is Product Management. In this episode, Rodney Knowles interviews Tricia Houston, the founder and COO of the Experience Build Group, about improving customer and employee experiences. Tricia emphasizes the importance of having a diverse team with different perspectives to create innovative solutions. She suggests starting small when implementing changes and using customer feedback to guide improvement efforts. Tricia also discusses the connection between customer experience and employee experience, and how they are interconnected. She highlights the value of understanding the customer journey and incorporating that into employee training. Lastly, Tricia recommends the book \"4,000 Weeks\" by Oliver Burkeman, which challenges the notion of constant productivity and encourages making mindful choices with limited time.", "podcast_guest": "Tricia Houston", "podcast_highlights": "Interesting insights from the transcript include:\n\n1. Tricia Houston emphasizes the importance of thinking about experiences as a mindset rather than a department. She believes that everyone in a company should be focused on providing a great customer experience, not just a designated customer experience team.\n\n2. Starting small is a key approach to improving the customer experience. Tricia suggests that companies can identify and address small gaps or issues in their customer experience, which can have a big impact on overall satisfaction.\n\n3. Tricia highlights the value of being your own customer and thinking about your own experiences as a consumer. By observing and internalizing these experiences, companies can gain valuable insights and apply them to their own products and services.\n\n4. Tricia discusses the connection between customer experience and employee experience. She believes that the customer experience is a byproduct of the employee experience, and that it's important for companies to focus on creating a positive and supportive work environment for their employees.\n\n5. Tricia shares insights on employee training and the importance of setting the stage for interactions with customers. She suggests that companies should focus on creating a script or guidelines for employees to follow, especially for customer-facing roles.\n\n6. Tricia recommends asking customers if doing business with the company is a chore or something they look forward to. This can provide valuable feedback on the overall customer experience and areas where improvements can be made.\n\n7. Tricia suggests a book recommendation: \"4,000 Weeks: Time Management for Mortals\" by Oliver Burkeman. The book challenges the notion of productivity and encourages readers to make mindful choices about how they spend their time.\n\nOverall, the transcript provides valuable insights into improving customer and employee experiences, starting small, and taking a holistic approach to the overall business and customer experience."}